#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 2482                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/2482                          #+#        #+#      #+#     #
#     Solved: 2024-03-08 11:59:06 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N,K=int(input()), int(input())
def solve():
    dp = [[0] * (N+1) for _ in range(K+1)]
    dp[0] = [1] * (N+1)
    
    for i in range(N+1):
        dp[1][i] = i
    
    for i in range(2,N+1):
        for k in range(2,K+1):
            dp[k][i] = dp[k][i-1] + dp[k-1][i-2]
            
    # 이게 이해가 안됨 
    print((dp[K-1][N-3] + dp[K][N-1]) % 1_000_000_003)
    
    
solve()