#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 10158                            :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/10158                         #+#        #+#      #+#     #
#     Solved: 2024-06-12 13:30:22 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

W,H = map(int,input().split())
P,Q = map(int,input().split())
T = int(input())
 
# 개미가 이동한 거리 - 왕복한 거리
a = (P+T) // W
b = (Q+T) // H
 
if a % 2 == 0:
    x = (P+T)%W
else:
    x = W-(P+T)%W
 
if b % 2 == 0:
    y = (Q+T)%H
else:
    y = H-(Q+T)%H
 
print(x, y)
 