#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 2839                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/2839                          #+#        #+#      #+#     #
#     Solved: 2023-10-26 16:27:23 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# 3x+5y=N
# x = 0 ~N//3 
# 나머지가 5로 나눠지면 끝 
N=int(input())
done = False 
for x in range(N//3):
    if (N-3*x)%5 == 0:
        done = True
        break
if done:
    print(x+ (N-3*x)//5)
elif (N % 3) ==0:
    print(N//3)
else:
    print(-1)