#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 2293                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/2293                          #+#        #+#      #+#     #
#     Solved: 2023-12-28 15:48:12 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N, K = map(int, input().split())
C = [int(input()) for _ in range(N)]
dp = [0] * (K + 1)
dp[0] = 1  # 금액 0을 만드는 방법은 아무것도 선택하지 않는 1가지
 
for c in C:
    for i in range(c, K + 1):
        dp[i] += dp[i - c]
 
print(dp[K])
 