#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 24337                            :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/24337                         #+#        #+#      #+#     #
#     Solved: 2024-05-10 11:37:11 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N,a,b = map(int,input().split())
if a+b > N+1:
    print(-1) 
else:
    # a=1인 경우는 예외로 왼쪽이 가장 높아야 함 
    if a == 1:
        # 가장 높은 것을 먼저 배치, 1을 최대한 넣고 나머지 
        ans = [b] + [1] * (N-b) + [i for i in range(b-1,0,-1)]
        # ans = [i for i in range(b,0,-1)] + [1] * (N-b)
    else:
        ans = [1] * (N-(a+b-1)) + [i for i in range(1,a)] + [max(a,b)] + [i for i in range(b-1,0,-1)]
    print(*ans)