#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 7570                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/7570                          #+#        #+#      #+#     #
#     Solved: 2024-09-26 05:37:10 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #



# 1. 정렬하고
# 2. 

N = int(input())
A = list(map(int, input().split()))
lis = [0] * (N+1) 
for i in range(N):
    # 연속해서 증가하는 경우를 찾아야 함. 그냥 증가 x 
    lis[A[i]] = lis[A[i]-1]+1 
print(N-max(lis))