#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 5052                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/5052                          #+#        #+#      #+#     #
#     Solved: 2024-08-02 10:13:23 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #


# 전화번호의 일관성이 있는지? 
# 어떤 번호가 다른 번호의 접두사이면 안됨
# ex)
# 911
# 9112 
# 911은 9112의 접두사 

# 접두사가 겹치려면
# 인접해야 겹치고
# 길이가 짧아야 함. 

# 911 
# 9123
# 91113828 


for _ in range(int(input())):
    N = int(input())
    CONTACT = [input() for _ in range(N)]
    CONTACT.sort()
    for i in range(N-1):
        # 바로 다음 것만 체크 
        if CONTACT[i] == CONTACT[i+1][:len(CONTACT[i])]:
            print("NO")
            break 
    else:
        print("YES")



"""
1
3
911
9123
91123

"""