#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 2225                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/2225                          #+#        #+#      #+#     #
#     Solved: 2024-03-15 14:41:41 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N,K = map(int,input().split())
# dp[i][k]= k개의 수를 더해 i를 만드는 방법의 수 
dp = [[0] * (K+1) for _ in range(N+1)]
 
dp[0][0] = 1 # 0개쓰고 0만들기는 1임 
for i in range(K+1):
    dp[0][i] = 1 # i개 사용해 0만들기 -> 0을 i개 사용 
 
for i in range(1,N+1):
    for k in range(1,K+1):
        for j in range(i+1):  
            dp[i][k] += dp[i-j][k-1] # k-1개를 합해 i-j + j를 더함 
        dp[i][k] %= 1_000_000_000
 
print(dp[-1][-1])