#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 2229                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/2229                          #+#        #+#      #+#     #
#     Solved: 2024-03-18 17:33:04 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N=int(input())
L=list(map(int,input().split()))
 
# 2 5 7 1 3 4 8 6 9 3
# 2 5 / 7 1 / 3 4 8 / 6 9 3 
# 3 6 5 6 -> 20 
 
dp = [0 for _ in range(N+1)]
 
# value, 최소, 최대 
for i in range(N+1):
    for j in range(i):
        dp[i] = max(dp[i], dp[j] + max(L[j:i]) - min(L[j:i]))
print(dp[-1])