#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 1328                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/1328                          #+#        #+#      #+#     #
#     Solved: 2024-03-15 20:15:10 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N,L,R = map(int,input().split())
dp = [[[0] * (N+1) for _ in range(N+1)] for _ in range(N+1)]
# 블록 0개 배치, 좌우 0개 보임
dp[0][0][0] = 1
# 블록 1개 배치, 좌우 1개 보임
dp[1][1][1] = 1 
for n in range(2,N+1):
    # n개 블록 사용 시 최대 n개 볼 수 있음. 
    for i in range(1,n+1):
        for j in range(1,n+1):
            dp[n][i][j] = (dp[n-1][i-1][j] + dp[n-1][i][j-1] + dp[n-1][i][j] * (n-2)) % 1000000007
 
print(dp[-1][L][R])