#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#     Problem Number: 1019                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#     By: magenta1223 <boj.kr/u/magenta1223>         +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#     https://boj.kr/1019                          #+#        #+#      #+#     #
#     Solved: 2024-03-08 18:44:26 by magenta1223  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

N = int(input())
count = [0] * 10
w = 1
while True: # ex) 11120        
    while N > 0 and N % 10 != 9: # 1. 뒷자리를 9로 만들기 : 11119
        for s in str(N):
            count[int(s)] += w
        N -= 1 
    if N < 10: # 2. 한자리 수 -> 더해주고 종료 
        for i in range(1,N+1):
            count[i] += w 
        break 
    # 3. 9가 되면 뒷자리를 떼고 곱하기
    # 1111 / 9 에서 마지막 1~9는 1111+1개, 0은 1111개 
    # 1을 예시로 들면 00001 ~ 11111
    N = int(str(N)[:-1])
    for i in range(10):
        count[i] += (N+1) * w
    count[0] -= w   # 3-1) 0은 1개 덜들어감 (00000은 없으니까)      
    w *= 10 # 4. 가중치 10배 (자릿수를 뗐으니)
print(*count)